{
  "Navbar": {
    "English": [
      "About me",
      "Certs",
      "Stack",
      "Contact Me",
      "Experience"
    ],
    "Spanish": [
      "Acerca de mi",
      "Certs",
      "Stack",
      "Contactame",
      "Experiencia"
    ]
  },
  "Welcome": {
    "English": {
      "Title": "Software Engineer. Full Stack Cloud",
      "HighligthedParagraph": "I am a web developer with 4+ years of experience",
      "CommonParagraph": "providing services and support at different projects to the most valuable companies in the world.",
      "PlaceHolderText": "Company name",
      "ButtonText": "Contact me"
    },
    "Spanish": {
      "Title": "Software Engineer. Full Stack Cloud",
      "HighligthedParagraph": "Soy un desarrollador web con mas de 4 años de experiencia",
      "CommonParagraph": "brindando servicios y soporte en distintos proyectos a las empresas mas importantes del mercado.",
      "PlaceHolderText": "Nombre de la compañia",
      "ButtonText": "Contactame"
    }
  },
  "Certs": {
    "English": {
      "HeaderTitle": "Certs",
      "HeaderSubtitle": "Take a look on my certs.",
      "HeaderInfo": "Some of the certs that I obtained during my career.",
      "CertItems": [
        {
          "CertTitle": "AWS Certified Cloud Practitioner",
          "Info": "The AWS Certified Cloud Practitioner certification validates a fundamental understanding of",
          "HighlightedInfo": "the AWS cloud, services, and terminology.",
          "ButtonText": "View certificate",
          "Image": "images/amazon-cert.png",
          "Link": "https://www.credly.com/badges/eb40a577-388c-4d3f-806b-99bbcb186439/linked_in_profile"
        },
        {
          "CertTitle": "AZ-204",
          "Info": "Earning Azure Developer Associate certification validates the skills and knowledge to design, build, test, and maintain ",
          "HighlightedInfo": "cloud applications and services on Microsoft Azure.",
          "ButtonText": "View certificate",
          "Image": "images/azure-developer-associate.png",
          "Link": "https://www.credly.com/badges/4baa5a63-eac0-4279-ad4c-60038d70324a/linked_in_profile"
        },
        {
          "CertTitle": "AZ-900",
          "Info": "Earners of the Azure Fundamentals certification have demonstrated foundational level knowledge of cloud services and ",
          "ButtonText": "View certificate",
          "HighlightedInfo": "how those services are provided with Microsoft Azure.",
          "Image": "images/az-900-cert.png",
          "Link": "https://www.credly.com/badges/689d0e8d-eadf-4795-81ae-bea00ee27825?source=linked_in_profile"
        },
        {
          "CertTitle": "Certified SAFE 5 Practitioner",
          "Info": "A Certified SAFe® 5 Practitioner (SP) is a SAFe team member professional responsible for using .",
          "HighlightedInfo": "Scrum, Kanban, and XP in a SAFe environment",
          "ButtonText": "View certificate",
          "Image": "images/safe-cert.png",
          "Link": "https://www.credly.com/badges/4b27546f-4312-437c-8305-a715936797da?source=linked_in_profile"
        }
      ]

    },
    "Spanish": {
      "HeaderTitle": "Certs",
      "HeaderSubtitle": "Echa un vistaso a mis certificationes.",
      "HeaderInfo": "Alguna de las certificacioens que obtuve...",
      "CertItems": [
        {
          "CertTitle": "AWS Certified Cloud Practitioner",
          "Info": "La certificación AWS Certified Cloud Practitioner valida una comprension fundamental",
          "HighlightedInfo": "de la nube de AWS, sus servicios y terminologia.",
          "ButtonText": "Ver Certificado",
          "Image": "images/amazon-cert.png",
          "Link": "https://www.credly.com/badges/eb40a577-388c-4d3f-806b-99bbcb186439/linked_in_profile"
        },
        {
          "CertTitle": "AZ-204",
          "Info": "Obtener la certificación Azure Developer Associate valida las habilidades y conocimientos para diseñar, construir, probar y mantener  ",
          "HighlightedInfo": "aplicaciones y servicios en la nube de Microsoft Azure.",
          "ButtonText": "Ver Certificado",
          "Image": "images/azure-developer-associate.png",
          "Link": "https://www.credly.com/badges/4baa5a63-eac0-4279-ad4c-60038d70324a/linked_in_profile"
        },
        {
          "CertTitle": "AZ-900",
          "Info": "Los que obtuvieron la certificación Azure Fundamentals han demostrado un conocimiento de nivel básico de los servicios en la nube y",
          "HighlightedInfo": "cómo se proporcionan esos servicios con Microsoft Azure.",
          "ButtonText": "Ver Certificado",
          "Image": "images/az-900-cert.png",
          "Link": "https://www.credly.com/badges/689d0e8d-eadf-4795-81ae-bea00ee27825?source=linked_in_profile"
        },
        {
          "CertTitle": "Certified SAFE 5 Practitioner",
          "Info": "Un practicante certificado de SAFe® 5 (SP) es un profesional miembro del equipo SAFe responsable de utilizar",
          "HighlightedInfo": "Scrum, Kanban,y XP en un ambiente de tipo SAFE.",
          "ButtonText": "Ver Certificado",
          "Image": "images/safe-cert.png",
          "Link": "https://www.credly.com/badges/4b27546f-4312-437c-8305-a715936797da?source=linked_in_profile"
        }
      ]

    }
  },
  "Stack": {
    "English": {
      "HeaderTitle": "Stack",
      "HeaderSubtitle": "My main stack",
      "HeaderInfo": "This is the stack that I use more",
      "SectionTitle": "Angular + .NET CORE + SQL Server + Azure Cloud",
      "Paragraphs": [
        "I have been working with this stack for more than 3 years.",
        "Even though I have also experience working with other frameworks and languages, this stack is the one that I sticked most to during my career.",
        "I am not including style UI frameworks like Bootstrap, Material, Kendo, etc, nonetheless I have solid experience with them too.",
        "I also  have experience with Azure pipelines, Ansible and YAML code.",
        "I have migrated   legacies on-premise systems to Azure cloud Architecture."
      ],
      "StackItems": [
        {
          "Image": "/Images/angular-logo.png",
          "Title": "Angular",
          "Info": "+4 years of experience working with this framework and its most popular dependencias , such as jest, material, bootstrap,etc"
        },
        {
          "Image": "/Images/Net.png",
          "Title": "Net core",
          "Info": "+4 years working as a Net core developer and the most relevant libraries, like signalR, Swagger, dapper, JWT, etc."
        },
        {
          "Image": "/Images/sql-logo.jpg",
          "Title": "SQL Server",
          "Info": "Solid experience working with SQL servers , developing Stored procedures, views, logins,  handling authorization, etc."
        },
        {
          "Image": "/Images/microsoft-azure.svg",
          "Title": "Azure cloud",
          "Info": "I have a good grasp and hands on experience on the main services, like keyvault, Azure SQL, Azure functions, blob storage, Azure signal R, app insight, etc."
        },
        {
          "Image": "/Images/JavaScript.png",
          "Title": "Javascript",
          "Info": "Along with C# this language is the one that I  have used most during my carrer, wich allows me to learn new frameworks and libraries seamlessly"
        },
        {
          "Image": "/Images/react-logo.webp",
          "Title": "React",
          "Info": "I have worked on couple of projects using react, nodeJs and MongoDb , it is not my most often used stack but I would perfectly fit on a project using it."
        },
        {
          "Image": "/Images/CSS3.jpg",
          "Title": "CSS",
          "Info": "Strong capabilities when it comes to css and to build layouts be they responsive or not, that allows me to work in projects from end to end. (From the Azure DB to the UI styling)"
        },
        {
          "Image": "/Images/EFCore.png",
          "Title": "EF Core",
          "Info": "Be it code first or database first, approaches, I can confidently manage them to provide solutions to connect with sql server DBs"
        },
        {
          "Image": "/Images/Linq.png",
          "Title": "LinQ",
          "Info": "I have great management of this tool that allows me to perform data querying efficiently."
        }
      ]
    },
    "Spanish": {
      "HeaderTitle": "Stack",
      "HeaderSubtitle": "Mi STACK principal",
      "HeaderInfo": "A continuacion, el STACK que mas he utilizado",
      "SectionTitle": "Angular + .NET CORE + SQL Server + Azure Cloud",
      "Paragraphs": [
        "He trabajado con este set de herramientas por mas de 3 años.",
        "A pesar de que tengo tambien experiencia utilizando otros stacks y lenguajes, este st de herramientas es al que me he apegado mas durante mi carrera.",
        "No estoy incluyendo todas las librerias de estilos de UI como Bootstrap, Material Kendo, etc, sin embargo tengo vasta experiencia en ellas tambien.",
        "Tambien puedo utilizar y dar soporte en Azure Pipelines, Ansible y codigo YAML.",
        "Durante mi carrera, he migrado aplicaciones on-premises de tipo legacy a arquitecturas de Azure en la nube."
      ],
      "StackItems": [
        {
          "Image": "/Images/angular-logo.png",
          "Title": "Angular",
          "Info": "+4 años de experiencia trabajando con este framework y sus dependencias mas populares, como Jest, Material, Bootstrap, etc."
        },
        {
          "Image": "/Images/Net.png",
          "Title": "Net core",
          "Info": "+4 Años de experience como desarrollador Net y con sus librerias mas relevantes, como SignalR, Swager, Dapper, JWT, etc."
        },
        {
          "Image": "/Images/sql-logo.jpg",
          "Title": "SQL Server",
          "Info": "Experiencia solida trabajando con SQL, desarrollando SPs, Views, loggins, Authz,etc"
        },
        {
          "Image": "/Images/microsoft-azure.svg",
          "Title": "Azure cloud",
          "Info": "Gran conocimiento y experiencia práctica en sus principales servicios como: Keyvault, Azure SQL, Azure Functions, Blob Storage, Azure SignalR, AppInsight, etc."
        },
        {
          "Image": "/Images/JavaScript.png",
          "Title": "Javascript",
          "Info": "Junto con C# , este lenguaje es el que mas he utilizado durante me carrera, lo que me permite aprender nuevos frameworks y librerias sin problemas."
        },
        {
          "Image": "/Images/react-logo.webp",
          "Title": "React",
          "Info": "He trabajado en algunos proyectos que utilizaban React NodeJS y MongoDB, no es el STACK  que mas utilizo pero podria perfectamente formar parte de un equipo que lo use."
        },
        {
          "Image": "/Images/CSS3.jpg",
          "Title": "CSS",
          "Info": "Gran capacidad a la hora de trabajar con CSS y para construir layouts , sean responsives o no. Esto me permite dar soporte en proyectos de punta a punta."
        },
        {
          "Image": "/Images/EFCore.png",
          "Title": "EF Core",
          "Info": "Ya sea code First o Database First puedo utilizar esta herramienta con seguridad a la hora de proveer soluciones que conecten con SQL server BDs."
        },
        {
          "Image": "/Images/Linq.png",
          "Title": "LinQ",
          "Info": "Tengo un gran manejo de esta herramienta lo que me permite desempeñar consultas de datos de manera eficiente."
        }
      ]
    }
  },
  "AboutMe": {
    "English": {
      "HeaderTitle": "About Me",
      "HeaderSubtitle": "Who is Facundo Vega?",
      "HeaderInfo": "A software engineer passionate about coding",
      "SectionTitle": "Hey, I'm Facundo.",
      "SectionSubtitle": "I’m a software engineer with plus 4 years of experience, in all kind of projects.",
      "Paragraphs": [
        "I am an experienced Full Stack Developer with over 4 years of expertise in the field. My skills encompass a range of technologies, including .NET, Angular, SQL Server, and Azure Cloud.",
        "As a Full Stack Developer, I have a strong foundation in both front-end and back-end development, allowing me to create robust and scalable web applications.",
        "In the realm of front-end development, I excel in utilizing Angular to build dynamic and responsive user interfaces that provide an exceptional user experience",
        "On the back end, I am well-versed in .NET, enabling me to create efficient server-side logic and RESTful APIs. I have extensive experience with SQL Server for database management and optimization, ensuring data integrity and performance.",
        "Moreover, I have a deep understanding of Azure Cloud services, enabling me to deploy and manage applications with reliability and scalability.",
        "My commitment to staying updated with the latest technologies and my passion for problem-solving make me a valuable asset to any development team. Let's collaborate to bring your projects to life!"
      ]
    },
    "Spanish": {
      "HeaderTitle": "Acerca de Mi",
      "HeaderSubtitle": "¿Quien es Facundo Vega?",
      "HeaderInfo": "Un software Engineer amante del codigo",
      "SectionTitle": "Hola, Soy Facundo.",
      "SectionSubtitle": "Soy un  software engineer con mas de 4 años de experiencia, en todo tipo de proyectos.",
      "Paragraphs": [
        "Soy un desarrollador Full Stack experimentado con más de 4 años de experiencia en el campo. Mis habilidades abarcan una variedad de tecnologías, incluidas .NET, Angular, SQL Server y Azure Cloud.",
        "Como desarrollador Full Stack, tengo una base sólida en desarrollo tanto front-end como back-end, lo que me permite crear aplicaciones web robustas y escalables.",
        "En el ámbito del desarrollo front-end, me destaco en el uso de Angular para crear interfaces de usuario dinámicas y responsives que brinden una experiencia de usuario excepcional.",
        "En el back-end, estoy bien versado en .NET, lo que me permite crear una lógica eficiente del lado del servidor y API RESTful. Tengo amplia experiencia con SQL Server para la gestión y optimización de bases de datos, garantizando la integridad y el rendimiento de los datos.",
        "Además, tengo un profundo conocimiento de los servicios de la nube de Azure, lo que me permite implementar y administrar aplicaciones con confiabilidad y escalabilidad.",
        "Mi compromiso de mantenerme actualizado con las últimas tecnologías y mi pasión por la resolución de problemas me convierten en un activo valioso para cualquier equipo de desarrollo. ¡Colaboremos para darle vida a tus proyectos!"
      ]
    }
  },
  "Experience": {
    "English": {
      "HeaderTitle": "Experience",
      "HeaderSubtitle": "Know about my experience.",
      "HeaderInfo": "A brief summary of my history on this industry",
      "SectionTitle": "Over the years,",
      "SectionParagraph": "With over four years of experience in the IT industry, my journey as a software developer has been both rewarding and enlightening. I've had the privilege of working with a diverse set of technologies, including .NET, Angular, SQL Server, and Azure Cloud, which have shaped my expertise. Throughout my career, I've contributed to a wide range of projects, from developing dynamic web applications with Angular to creating robust back-end solutions with .NET. SQL Server has been instrumental in my ability to design efficient and reliable databases, while Azure Cloud has allowed me to harness the power of the cloud for scalable and secure solutions. What sets my experience apart is the constant pursuit of innovation and staying abreast of industry trends. I've enjoyed collaborating with cross-functional teams, solving complex problems, and delivering high-quality software that meets the evolving needs of clients and organizations. My passion for technology and dedication to excellence continue to drive my success in the ever-evolving IT landscape."
    },
    "Spanish": {
      "HeaderTitle": "Experiencia",
      "HeaderSubtitle": "Conoce acerca de mi experiencia",
      "HeaderInfo": "Un breve resumen de mi historia en esta industria.",
      "SectionTitle": "A travez de los años",
      "SectionParagraph": "Con más de cuatro años de experiencia en la industria de TI, mi trayectoria como desarrollador de software ha sido a la vez gratificante y esclarecedora. He tenido el privilegio de trabajar con un conjunto diverso de tecnologías, incluidas .NET, Angular, SQL Server y Azure Cloud, que han dado forma a mi experiencia. A lo largo de mi carrera, he contribuido a una amplia gama de proyectos, desde el desarrollo de aplicaciones web dinámicas con Angular hasta la creación de soluciones back-end sólidas con .NET. SQL Server ha sido fundamental en mi capacidad para diseñar bases de datos eficientes y confiables, mientras que Azure Cloud me ha permitido aprovechar el poder de la nube para soluciones escalables y seguras. Lo que distingue mi experiencia es la búsqueda constante de innovación y estar al tanto de las tendencias de la industria. Disfruté colaborando con equipos multifuncionales, resolviendo problemas complejos y entregando software de alta calidad que satisfaga las necesidades cambiantes de clientes y organizaciones. Mi pasión por la tecnología y mi dedicación a la excelencia continúan impulsando mi éxito en el panorama de TI en constante evolución."
    }
  },
  "ContactMe": {
    "English": {
      "Title": "Contact me",
      "Subtitle": "Got a Project? Lets Talk!",
      "Links": [
        {
          "IdRedirect": "certs",
          "value": "Certs"
        },
        {
          "IdRedirect": "stack",
          "value": "Stack"
        },
        {
          "IdRedirect": "about-me",
          "value": "About me"
        }
      ]
    },
    "Spanish": {
      "Title": "Contactame",
      "Subtitle": "Tienes un proyecto? Hablemos!",
      "Links": [
        {
          "IdRedirect": "certs",
          "value": "Certs"
        },
        {
          "IdRedirect": "stack",
          "value": "Stack"
        },
        {
          "IdRedirect": "about-me",
          "value": "Acerca de mi"
        }
      ]
    }
  },
  "Footer": {
    "English": {
      "MainParagraph": "Software Engineer. Full stack web developer.",
      "CommonParagraph": "Providing and supporting IT solutions since 4+ years.Azure cloud certified developer.",
      "SecondaryParagraphTitle": "Ready to boost your projects?",
      "SecondaryCommonParagraph": "deliver outstanding results for your company.",
      "SecondaryHighligthedParagraph": "Let's partner for success! I bring experience, innovation, and dedication to ",
      "InputPlaceholder": "Company Name",
      "ButtonText": "Contact me"
    },
    "Spanish": {
      "MainParagraphTitle": "Software Engineer. Full stack web developer.",
      "CommonParagraph": "Proporcionando y respaldando soluciones de TI desde hace más de 4 años.Desarrollador Azure Cloud certificado",
      "SecondaryParagraphTitle": "¿Listo para impulsar tus proyectos?",
      "SecondaryCommonParagraph": "ofrecer resultados sobresalientes para su empresa.",
      "SecondaryHighligthedParagraph": "¡Aliémonos para lograr el éxito! Aporto experiencia, innovación y dedicación para ",
      "InputPlaceholder": "Nombre de la compañia",
      "ButtonText": "Contactame"
    }
  }

}